Catalogs/ТочкиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТочкиДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПереопределен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиДоставки/Ext/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОсновнаяТочка Тогда
		
		Если ПометкаУдаления Тогда
			
			ТекстСообщения = НСтр("ru = 'Невозможно пометить на удаление основную точку доставки'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновнаяТочка",, Отказ);
			
		КонецЕсли;
		
		ПроверитьПризнакНеИспользуется(Отказ);
		
	КонецЕсли;
	
	ПроверитьУникальность(Отказ);
	
	//++ Локализация
	
	МассивНепроверяемыхРеквизитов = Новый Массив; // Массив из Строка
	
	Если НЕ ИдентификаторПереопределен Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторТочкиДоставки");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	//-- Локализация
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ИдентификаторПереопределен Тогда
		
		ИдентификаторТочкиДоставки = "";
		
	КонецЕсли;
	
	Если ОсновнаяТочка Тогда
		
		Если ПометкаУдаления Тогда
			
			ТекстСообщения = НСтр("ru = 'Невозможно пометить на удаление основную точку доставки'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
			
		КонецЕсли;
		
		ПроверитьПризнакНеИспользуется(Отказ);
		
	КонецЕсли;
	
	ПроверитьУникальность(Отказ, Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОсновнаяТочка = Ложь;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОсновнаяТочка Тогда
		
		ТекстСообщения = НСтр("ru = 'Невозможно удалить основную точку доставки'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
		ПроверитьПризнакНеИспользуется(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПризнакНеИспользуется(Отказ)
	
	Если ОсновнаяТочка
	   И НеИспользуется Тогда
		
		ТекстСообщения = НСтр("ru = 'Невозможно отключение использования: точка является основным адресом доставки'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НеИспользуется",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУникальность(Отказ, ВыполнятьСБлокировкой = Ложь)
	
	Если ЗначениеЗаполнено(ИдентификаторТочкиДоставки)
		И ИдентификаторПереопределен Тогда
		
		ДействующийИдентификатор = ИдентификаторТочкиДоставки;
		ПолеИдентификатора = "Объект.ИдентификаторТочкиДоставки";
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторАдреса) Тогда
		
		ДействующийИдентификатор = ИдентификаторАдреса;
		ПолеИдентификатора = "Объект.ИдентификаторАдреса";
		
	Иначе
		
		ПолеИдентификатора = "";
		ДействующийИдентификатор = "";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаКонтроля();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ОсновнаяТочка", ОсновнаяТочка);
	Запрос.УстановитьПараметр("ДействующийИдентификатор", ДействующийИдентификатор);
	
	Если ВыполнятьСБлокировкой Тогда
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ТочкиДоставки");
			ЭлементБлокировки.УстановитьЗначение("Владелец", Владелец);
			
			Блокировка.Заблокировать();
			
		Исключение
			
			ШаблонОшибки = НСтр("ru = 'Не удалось заблокировать точки доставки владельца для контроля уникальности:
								|%1'");
			ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки, 
				ОписаниеОшибки);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВерхнийИндекс = РезультатыЗапроса.ВГраница();
	РезультатПоАдресу = РезультатыЗапроса[ВерхнийИндекс];
	РезультатПоИдентификатору = РезультатыЗапроса[ВерхнийИндекс - 1];
	РезультатПоОсновнойТД = РезультатыЗапроса[ВерхнийИндекс - 2];
	
	ПредставлениеВладельца = ОбщегоНазначения.ПредметСтрокой(Владелец);
	Если Не РезультатПоОсновнойТД.Пустой() Тогда
		
		ШаблонСообщения = НСтр("ru = 'По владельцу %1 уже зафиксирована основная точка доставки ""%2""'");
		
		Выборка = РезультатПоОсновнойТД.Выбрать();
		Выборка.Следующий();
		
		ПредставлениеТочкиДоставки = Выборка.Представление; // Строка
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ПредставлениеВладельца,
			ПредставлениеТочкиДоставки);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновнаяТочка",, Отказ);
		
	КонецЕсли;
	
	Если Не РезультатПоИдентификатору.Пустой() Тогда
		
		ШаблонСообщения = НСтр("ru = 'Для владельца %1 уже существует точка доставки с идентификатором %2: ""%3""'");
		
		Выборка = РезультатПоИдентификатору.Выбрать();
		Выборка.Следующий();
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ПредставлениеВладельца,
			ДействующийИдентификатор,
			Выборка.Представление);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПолеИдентификатора,, Отказ);
		
	КонецЕсли;
	
	Если Не РезультатПоАдресу.Пустой() Тогда
		
		ШаблонСообщения = НСтр("ru = 'Для владельца %1 уже существует точка доставки с адресом %2: ""%3""'");
		
		Выборка = РезультатПоАдресу.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			АдресСовпадает = (СтрСравнить(Выборка.Адрес, Адрес) = 0);
			Если АдресСовпадает Тогда
				
				ПредставлениеТочкиДоставки = Выборка.Представление; // Строка
				НайденныйАдрес = Выборка.Адрес; // Строка
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонСообщения,
					ПредставлениеВладельца,
					НайденныйАдрес,
					ПредставлениеТочкиДоставки);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Адрес",, Отказ);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаКонтроля()
	
	ТекстыЗапросовКонтроля = Новый Массив; // Массив из Строка
	ТекстыЗапросовКонтроля.Добавить(ТекстЗапросаТДВладельца());
	ТекстыЗапросовКонтроля.Добавить(ТекстЗапросаКонтрольОсновнойТД());
	ТекстыЗапросовКонтроля.Добавить(ТекстЗапросаУникальностьПоИдентификаторам());
	ТекстыЗапросовКонтроля.Добавить(ТекстЗапросаУникальностьПоАдресу());
	
	Разделитель = ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = СтрСоединить(ТекстыЗапросовКонтроля, Разделитель);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТДВладельца()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК Ссылка,
	|	ТочкиДоставки.ОсновнаяТочка КАК ОсновнаяТочка,
	|	ТочкиДоставки.Адрес КАК Адрес,
	|	ТочкиДоставки.ИдентификаторАдреса КАК ИдентификаторАдреса,
	|	ТочкиДоставки.ИдентификаторТочкиДоставки КАК ИдентификаторТочкиДоставки
	|ПОМЕСТИТЬ ВТ_ТочкиВладельца
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Владелец
	|	И ТочкиДоставки.Ссылка <> &Ссылка
	|	И НЕ ТочкиДоставки.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтрольОсновнойТД()
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ТочкиДоставки.Ссылка) КАК Представление
	|ИЗ
	|	ВТ_ТочкиВладельца КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.ОсновнаяТочка
	|	И &ОсновнаяТочка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаУникальностьПоИдентификаторам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТочкиДоставки.Ссылка) КАК Представление
	|ИЗ
	|	ВТ_ТочкиВладельца КАК ТочкиДоставки
	|ГДЕ
	|	&ДействующийИдентификатор <> """"
	|	И СОКРЛП(ТочкиДоставки.ИдентификаторТочкиДоставки) = """"
	|	И ТочкиДоставки.ИдентификаторАдреса = &ДействующийИдентификатор
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТочкиДоставки.Ссылка) КАК Представление
	|ИЗ
	|	ВТ_ТочкиВладельца КАК ТочкиДоставки
	|ГДЕ
	|	&ДействующийИдентификатор <> """"
	|	И ТочкиДоставки.ИдентификаторТочкиДоставки = &ДействующийИдентификатор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаУникальностьПоАдресу()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТочкиДоставки.Ссылка) КАК Представление,
	|	ТочкиДоставки.Адрес КАК Адрес
	|ИЗ
	|	ВТ_ТочкиВладельца КАК ТочкиДоставки
	|ГДЕ
	|	СОКРЛП(ТочкиДоставки.ИдентификаторАдреса) = """"
	|	И СОКРЛП(ТочкиДоставки.ИдентификаторТочкиДоставки) = """"
	|	И &ДействующийИдентификатор = """"";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
